emacs/config.org
* Terminal
** Bash default shell
#+begin_src emacs-lisp
  (defvar my-term-shell "/bin/bash")
  (defadvice ansi-term (before force-bash)
    (interactive (list my-term-shell)))
  (ad-activate 'ansi-term)
#+end_src

* Emacs
** Line
#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** GUI
#+begin_src emacs-lisp
  (when window-system (global-hl-line-mode t))
  (when window-system (global-prettify-symbols-mode t))

  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)

  ;; deactivate dashboard
  ;; (setq inhibit-startup-message t)
#+end_src

** Backup Files
#+begin_src emacs-lisp
  (setq make-backup-file nil)
  (setq auto-save-default nil)
#+end_src

** Text Editing
#+begin_src emacs-lisp
  ;; scrollear arreglado
  (setq scroll-conservatively 100)

  ;; silenciar campana
  ;; (setq ring-bell-function 'ignore)
#+end_src

* Org
** Org Bullets
#+begin_src emacs-lisp
  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda() (org-bullets-mode))))
#+end_src

* Packages
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :init
    (which-key-mode))

  (use-package beacon
    :ensure t
    :init
    (beacon-mode 1))
#+end_src
